{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 128, 250, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "sequential_input"
            }
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 128, 250, 3],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "rescaling_input"
                  }
                },
                {
                  "class_name": "Rescaling",
                  "config": {
                    "name": "rescaling",
                    "trainable": true,
                    "dtype": "float32",
                    "scale": 0.00392156862745098,
                    "offset": 0.0
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 11,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "max_pooling2d",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [2, 2],
                    "padding": "valid",
                    "strides": [2, 2],
                    "data_format": "channels_last"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 3,
                    "kernel_size": [6, 6],
                    "strides": [1, 1],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "max_pooling2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [2, 2],
                    "padding": "valid",
                    "strides": [2, 2],
                    "data_format": "channels_last"
                  }
                },
                {
                  "class_name": "Flatten",
                  "config": {
                    "name": "flatten",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 200,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout",
                    "trainable": true,
                    "batch_input_shape": [null, 2],
                    "dtype": "float32",
                    "rate": 0.4,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 50,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "batch_input_shape": [null, 2],
                    "dtype": "float32",
                    "rate": 0.4,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 6,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                }
              ]
            }
          },
          {
            "class_name": "Softmax",
            "config": {
              "name": "softmax",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "conv2d/kernel", "shape": [3, 3, 3, 11], "dtype": "float32" },
        { "name": "conv2d/bias", "shape": [11], "dtype": "float32" },
        {
          "name": "conv2d_1/kernel",
          "shape": [6, 6, 11, 3],
          "dtype": "float32"
        },
        { "name": "conv2d_1/bias", "shape": [3], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [5133, 200], "dtype": "float32" },
        { "name": "dense/bias", "shape": [200], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [200, 50], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [50], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [50, 6], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [6], "dtype": "float32" }
      ]
    }
  ]
}
