{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 128, 250, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "sequential_input"
            }
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 128, 250, 3],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "rescaling_input"
                  }
                },
                {
                  "class_name": "Rescaling",
                  "config": {
                    "name": "rescaling",
                    "trainable": true,
                    "dtype": "float32",
                    "scale": 0.00392156862745098,
                    "offset": 0.0
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 5,
                    "kernel_size": [6, 6],
                    "strides": [1, 1],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "max_pooling2d",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [2, 2],
                    "padding": "valid",
                    "strides": [2, 2],
                    "data_format": "channels_last"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 3,
                    "kernel_size": [12, 12],
                    "strides": [1, 1],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "max_pooling2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [2, 2],
                    "padding": "valid",
                    "strides": [2, 2],
                    "data_format": "channels_last"
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 40,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout",
                    "trainable": true,
                    "batch_input_shape": [null, 2],
                    "dtype": "float32",
                    "rate": 0.45,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "Flatten",
                  "config": {
                    "name": "flatten",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 500,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "batch_input_shape": [null, 2],
                    "dtype": "float32",
                    "rate": 0.45,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 250,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_2",
                    "trainable": true,
                    "batch_input_shape": [null, 2],
                    "dtype": "float32",
                    "rate": 0.45,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 65,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_3",
                    "trainable": true,
                    "batch_input_shape": [null, 2],
                    "dtype": "float32",
                    "rate": 0.45,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 6,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                }
              ]
            }
          },
          {
            "class_name": "Softmax",
            "config": {
              "name": "softmax",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of27.bin",
        "group1-shard2of27.bin",
        "group1-shard3of27.bin",
        "group1-shard4of27.bin",
        "group1-shard5of27.bin",
        "group1-shard6of27.bin",
        "group1-shard7of27.bin",
        "group1-shard8of27.bin",
        "group1-shard9of27.bin",
        "group1-shard10of27.bin",
        "group1-shard11of27.bin",
        "group1-shard12of27.bin",
        "group1-shard13of27.bin",
        "group1-shard14of27.bin",
        "group1-shard15of27.bin",
        "group1-shard16of27.bin",
        "group1-shard17of27.bin",
        "group1-shard18of27.bin",
        "group1-shard19of27.bin",
        "group1-shard20of27.bin",
        "group1-shard21of27.bin",
        "group1-shard22of27.bin",
        "group1-shard23of27.bin",
        "group1-shard24of27.bin",
        "group1-shard25of27.bin",
        "group1-shard26of27.bin",
        "group1-shard27of27.bin"
      ],
      "weights": [
        { "name": "conv2d/kernel", "shape": [6, 6, 3, 5], "dtype": "float32" },
        { "name": "conv2d/bias", "shape": [5], "dtype": "float32" },
        {
          "name": "conv2d_1/kernel",
          "shape": [12, 12, 5, 3],
          "dtype": "float32"
        },
        { "name": "conv2d_1/bias", "shape": [3], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [3, 40], "dtype": "float32" },
        { "name": "dense/bias", "shape": [40], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [55000, 500], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [500], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [500, 250], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [250], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [250, 65], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [65], "dtype": "float32" },
        { "name": "dense_4/kernel", "shape": [65, 6], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [6], "dtype": "float32" }
      ]
    }
  ]
}
